input/case_template/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($velocityInlet 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $velocityField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $velocityOutlet;
        value           uniform $velocityOutlet;
    }
    walls
    {
        type            slip;
    }
    #include "include/boundaries"
}

// ************************************************************************* //
