input/case_template/0/include/boundaries
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      boundaries;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

front
{
    type            empty;
}
back
{
    type            empty;
}
bottom
{
    type            symmetryPlane;
}
defaultFaces
{
    type            empty;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
