input/case_template/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "include/initialConditions"

// Dimensions: [mass][length^-3]
dimensions      [1 -3 0 0 0 0 0];

internalField   uniform $rhoInlet;   // Initial density in kg/m^3

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
        type            fixedValue;
        value           uniform $rhoInlet;
    }
    walls
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    #include "include/boundaries"
}

// ************************************************************************* //
